      *COBOL'S 4 DIVISIONS. THE IDENTIFICATION AND PROCEDURE ARE NEEDED 
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVISIONS.
      *************************************************
      *AUTHOR = GABRIEL
      *OBJECTIVE = SHOW THE COBOL'S DIVISIONS
      *DATE = 2022/03/14
      *************************************************
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       PROCEDURE DIVISION.
           STOP RUN.

       
       