       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.
      *******************************
      * AUTHOR		= GABRIEL
      * OBJECTIVE	= PRINT A "HELLO WORLD" MESSAGE
      * DATE		= 2022/03/11
      *******************************
       PROCEDURE DIVISION.
           DISPLAY "Hello World".
	   STOP RUN.
      * MUST END WITH AN EMPTY LINE
