       IDENTIFICATION DIVISION.
       PROGRAM-ID. VARIABLES.
      *********************************************
      *AUTHOR = GABRIEL
      *OBJECTIVE = SEE LEVEL 77 VARIABLE'S USE
      *DATE = 2022/03/14
      *********************************************
      *THE VARIABLES ARE DECLARED ON DATA DIVISION
      *THIS DIVISION HAVE 3 SECTIONS: WORKING, FILE AND LINKAGE
      *THE LEVEL 77 DEFINE A VARIABLE AS LOCAL AND PUBLIC
      *IS A GOOD PRACTICE TO USE SECTION PREFIX ON THE VARIABLE'S NAME
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *THE FUNCTION PICTURE/PIC DEFINE THE VARIABLE'S TYPE
      *A -> ALPHABETIC TYPE
      *X -> ALPHANUMERIC TYPE
      *9 -> NUMERIC TYPE
      *Z -> NUMERIC TYPE, IGNORE LEFT ZEROES
      ** -> LIKE Z BUT SHOWS * INSTEAD OF ZERO
      *- -> THIS CLAUSE APPEARS IF THE NUMBER IS NEGATIVE
      *+ -> LIKE - BUT FOR POSITIVE NUMBERS
      *. -> REPRESENT THE DECIMAL POSITION OF A NUMBER
      *, -> USED TO DISPLAY AN AMOUNT OF VALUES
      *$ -> USED ON LEFTMOST POSITION, USED FOR CURRENCY
      *THE OCCURRENCE NUMBER DEFINE THE AMOUNT IT CAN RECEIVE
      *E.G PICTURE AAAAAAAAAA -> CAN RECEIVE 10 LETTERS
      *CAN BE SHORTLY WRITEN AS PICTURE A(10)
       77 WRK-DEFAULT-NAME PICTURE A(7) VALUE 'DEFAULT'.
       77 WRK-USER-NAME PICTURE A(15).
      *THE ACCEPT FUNCTION RECEIVE AN PROMPTED VALUE
       PROCEDURE DIVISION.
           DISPLAY WRK-DEFAULT-NAME.
           DISPLAY "Input your name:".
           ACCEPT WRK-USER-NAME FROM CONSOLE.
           DISPLAY 'Your name is ' WRK-USER-NAME.
           STOP RUN.
